---
kind: method
id: M:Autodesk.Revit.DB.PartUtils.IsMergedPart(Autodesk.Revit.DB.Part)
source: html/ef0a6341-df93-54ce-99dd-6d61e4c5fcdc.htm
---
# Autodesk.Revit.DB.PartUtils.IsMergedPart Method

Is the Part the result of a merge.

## Syntax (C#)
```csharp
public static bool IsMergedPart(
	Part part
)
```

## Parameters
- **part** (`Autodesk.Revit.DB.Part`)

## Returns
True if the Part is the result of a merge operation.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null